music_app/app/controllers/bands_controller.rb

DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
    def destroy
        @band = Band.find_by(:id [params[:id]])
        @band.destroy